import json

FIVE_SPACE = " "*5

with open("src\\config.json", 'r', encoding="utf-8") as f:
    CONFIG = json.load(f)

with open("src\\npc.json", 'r', encoding="utf-8") as f:
    NPCS = json.load(f)

NPC_DRUNK_WORDS = [
    "今天的心情貌似很不错，一边喝一边笑",
    "貌似有点悲伤，喝醉后一直念叨着听不清的话",
    "拍着桌子嚷嚷“再来一壶！”，酒杯都晃得洒了半杯",
    "抱着酒坛趴在桌上，嘴里嘟囔着“这酒没去年的甜”",
    "拉着旁边人的袖子，碎碎念自己年轻时的威风事",
    "眼神发直盯着空酒杯，突然“啪”地一拍桌：“谁偷喝了我的酒？！”",
    "红着脸哼跑调的小曲，脚还跟着乱晃拍子",
    "捏着酒杯眼泪吧嗒往下掉，嘴里念叨“你怎么就走了啊”",
]

SOUNDS = {}

PAGE_TIPS = {
    "酿酒":["酿酒技巧决定着你的酿酒成功率","每次酿酒成功+1%酿酒技巧"],
    "采购":["集市上的其他物品每日只能买1份"],
    "营业":["声望越高，来的高级客人越多", "高级客人消费更高，声望提升也更高，还有可能给你小费", "最好不要赶走客人，他们会有50%的几率闹事"],
    "修缮":["通过修缮酒吧来提升你的酒馆耐久", "时刻关注你的酒馆耐久"],
    "账本":["查看酒馆账本并不会结束今日，你还可以返回继续其它的今日操作", "账本记录了你的销量、利润和债务"],
    "结束":["跳过今日不营业，会损失酒馆的声望", "跳过今日不营业是个很不明智的选择"]
}